ASSIGNMENT - 3

Question 1: Create a dataset as follow in the table.

In [2]:
import pandas as pd
mydata = {'Tid':[1,2,3,4,5,6,7,8,9,10],
          'Refund':["Yes","No","No","Yes","No","No","Yes","No","No","No"],
          'Marital Status':["Single","Married","Single","Married","Divorced","Married","Divorced","Single","Married","Single"],
          'Taxable Income':["125K","100K","70K","120K","95K","60K","220K","85K","75K","90K"],
          'Cheat':["No","No","No","No","Yes","No","No","Yes","No","Yes"]
         }
myvar = pd.DataFrame(mydata)
print(myvar)

   Tid Refund Marital Status Taxable Income Cheat
0    1    Yes         Single           125K    No
1    2     No        Married           100K    No
2    3     No         Single            70K    No
3    4    Yes        Married           120K    No
4    5     No       Divorced            95K   Yes
5    6     No        Married            60K    No
6    7    Yes       Divorced           220K    No
7    8     No         Single            85K   Yes
8    9     No        Married            75K    No
9   10     No         Single            90K   Yes

Question 2: From the above table that you have created, locate row 0, 4, 7 and 8 using DataFrame

In [3]:
myvar.iloc[0]

Tid                    1
Refund               Yes
Marital Status    Single
Taxable Income      125K
Cheat                 No
Name: 0, dtype: object

In [4]:
myvar.iloc[4]

Tid                      5
Refund                  No
Marital Status    Divorced
Taxable Income         95K
Cheat                  Yes
Name: 4, dtype: object

In [5]:
myvar.iloc[7]

Tid                    8
Refund                No
Marital Status    Single
Taxable Income       85K
Cheat                Yes
Name: 7, dtype: object

In [6]:
myvar.iloc[8]

Tid                     9
Refund                 No
Marital Status    Married
Taxable Income        75K
Cheat                  No
Name: 8, dtype: object

Question 3: Navigate the DataFrame and do the following task for the table created in question 1:

1. Select row from index 3 to 7

In [8]:
myvar.iloc[3:8]

   Tid Refund Marital Status Taxable Income Cheat
3    4    Yes        Married           120K    No
4    5     No       Divorced            95K   Yes
5    6     No        Married            60K    No
6    7    Yes       Divorced           220K    No
7    8     No         Single            85K   Yes

2. Select row from index 4 to 8, and column 2 to 4

In [9]:
myvar.iloc[4:9,2:5]

  Marital Status Taxable Income Cheat
4       Divorced            95K   Yes
5        Married            60K    No
6       Divorced           220K    No
7         Single            85K   Yes
8        Married            75K    No

3. Select all rows with column index 1 to 3 (include index 3 during selection)

In [10]:
myvar.iloc[0:10,1:4]

  Refund Marital Status Taxable Income
0    Yes         Single           125K
1     No        Married           100K
2     No         Single            70K
3    Yes        Married           120K
4     No       Divorced            95K
5     No        Married            60K
6    Yes       Divorced           220K
7     No         Single            85K
8     No        Married            75K
9     No         Single            90K

Question 4: Read a csv file and display its first five rows

In [1]:
import pandas as pd
df = pd.read_csv("Iris.csv")
print(df.iloc[:5])

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

Question 5: From the csv file (uploaded in the Q.4) delete row 4, and delete column 3. Display the result.

In [2]:
import pandas as pd
df=pd.read_csv("Iris.csv")
df=df.drop(index=4)
df=df.drop(columns="PetalLengthCm")
print(df)

      Id  SepalLengthCm  SepalWidthCm  PetalWidthCm         Species
0      1            5.1           3.5           0.2     Iris-setosa
1      2            4.9           3.0           0.2     Iris-setosa
2      3            4.7           3.2           0.2     Iris-setosa
3      4            4.6           3.1           0.2     Iris-setosa
5      6            5.4           3.9           0.4     Iris-setosa
..   ...            ...           ...           ...             ...
145  146            6.7           3.0           2.3  Iris-virginica
146  147            6.3           2.5           1.9  Iris-virginica
147  148            6.5           3.0           2.0  Iris-virginica
148  149            6.2           3.4           2.3  Iris-virginica
149  150            5.9           3.0           1.8  Iris-virginica

[149 rows x 5 columns]

Question 6: Create a sample dataset (employees.csv) containing information about employees in a company.

In [4]:
import pandas as pd
data = {
    "Employee ID":[101,102,103,104,105],
    "Name":["Alice","Bob","Charlie","Diana","Edward"],
    "Department":["HR","IT","IT","MARKETING","SALES"],
    "Age":[29,34,41,28,38],
    "Salary":[50000,70000,65000,55000,60000],
    "Years_of_Experience": [4, 8, 10, 3, 12],
    "Joining_Date": ["2020-03-15", "2017-07-19", "2013-06-01", "2021-02-10", "2010-11-25"],
    "Gender": ["Female", "Male", "Male", "Female", "Male"],
    "Bonus": [5000, 7000, 6000, 4500, 5000],
    "Rating": [4.5, 4.0, 3.8, 4.7, 3.5],
}
df=pd.DataFrame(data)
df.to_csv("employees.csv")

a) Shape (number of rows and columns) of the DataFrame.

In [5]:
print("Displaying Shape of the DataFrame")
print(df.shape)

Displaying Shape of the DataFrame
(5, 10)

b) Summary of the DataFrame that includes the data types and non-null counts for each column.

In [6]:
print("\nDisplaying Summary of the DataFrame:")
print(df.dtypes)

Displaying Summary of the DataFrame:
Employee ID              int64
Name                    object
Department              object
Age                      int64
Salary                   int64
Years_of_Experience      int64
Joining_Date            object
Gender                  object
Bonus                    int64
Rating                 float64
dtype: object

c) Generate descriptive statistics.

In [7]:
print("\nDispalying general descriptive statistics")
print(df.describe())

Dispalying general descriptive statistics
       Employee ID        Age       Salary  Years_of_Experience   Bonus  \
count     5.000000   5.000000      5.00000             5.000000     5.0
mean    103.000000  34.000000  60000.00000             7.400000  5500.0
std       1.581139   5.612486   7905.69415             3.847077  1000.0
min     101.000000  28.000000  50000.00000             3.000000  4500.0
25%     102.000000  29.000000  55000.00000             4.000000  5000.0
50%     103.000000  34.000000  60000.00000             8.000000  5000.0
75%     104.000000  38.000000  65000.00000            10.000000  6000.0
max     105.000000  41.000000  70000.00000            12.000000  7000.0

         Rating
count  5.000000
mean   4.100000
std    0.494975
min    3.500000
25%    3.800000
50%    4.000000
75%    4.500000
max    4.700000

d) Display the first 5 rows and last 3 rows of the dataset.

In [8]:
print("\n Displaying First 5 and last 3 rows:")
print(df.head(5))
print(df.tail(3))

 Displaying First 5 and last 3 rows:
   Employee ID     Name Department  Age  Salary  Years_of_Experience  \
0          101    Alice         HR   29   50000                    4
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
3          104    Diana  MARKETING   28   55000                    3
4          105   Edward      SALES   38   60000                   12

  Joining_Date  Gender  Bonus  Rating
0   2020-03-15  Female   5000     4.5
1   2017-07-19    Male   7000     4.0
2   2013-06-01    Male   6000     3.8
3   2021-02-10  Female   4500     4.7
4   2010-11-25    Male   5000     3.5
   Employee ID     Name Department  Age  Salary  Years_of_Experience  \
2          103  Charlie         IT   41   65000                   10
3          104    Diana  MARKETING   28   55000                    3
4          105   Edward      SALES   38   60000                   12

  Joining_Date  Gender  Bonus  Rating
2   2013-06-01    Male   6000     3.8
3   2021-02-10  Female   4500     4.7
4   2010-11-25    Male   5000     3.5

e) Calculate the following statistics from the dataset:
i. The average salary of employees.

In [10]:
print("\nDisplaying Average Salary of the Employees:")
print(df["Salary"].mean())

Displaying Average Salary of the Employees:
60000.0

ii. The total bonus paid to all employees.

In [11]:
print("\nDisplaying total bonus:")
print(df["Bonus"].sum())

Displaying total bonus:
27500

iii. The youngest employee's age.

In [12]:
print("\n Displaying Youngest Employees Age:")
youngest_age=df["Age"].min()
print(youngest_age)

 Displaying Youngest Employees Age:
28

iv. The highest performance rating.

In [13]:
print("\nDisplaying Highest performance rating:")
hp_rating=df["Rating"].max()
print(hp_rating)

Displaying Highest performance rating:
4.7

f)Sort the DataFrame by the Salary column in descending order.

In [14]:
sorted_df=df.sort_values(by="Salary",ascending=False)
print("\n",sorted_df)

    Employee ID     Name Department  Age  Salary  Years_of_Experience  \
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
4          105   Edward      SALES   38   60000                   12
3          104    Diana  MARKETING   28   55000                    3
0          101    Alice         HR   29   50000                    4

  Joining_Date  Gender  Bonus  Rating
1   2017-07-19    Male   7000     4.0
2   2013-06-01    Male   6000     3.8
4   2010-11-25    Male   5000     3.5
3   2021-02-10  Female   4500     4.7
0   2020-03-15  Female   5000     4.5

g)Add a new column that categorizes employees based on their performance rating:<br>

i. Excellent for ratings >= 4.5<br>
ii. Good for ratings >= 4.0 but < 4.5<br>
iii. Average for ratings < 4.0

In [15]:
df["Performance Category"]=pd.cut(df["Rating"],bins=[0,4.0,4.5,5.0],labels=["Average","Good","Excellent"])
print("\n")
print(df[["Name","Performance Category"]])

      Name Performance Category
0    Alice                 Good
1      Bob              Average
2  Charlie              Average
3    Diana            Excellent
4   Edward              Average

h)Identify missing values in the DataFrame.

In [16]:
print("\nChecking for missing values in the DataFrame:")
print(df.isnull().sum())

Checking for missing values in the DataFrame:
Employee ID             0
Name                    0
Department              0
Age                     0
Salary                  0
Years_of_Experience     0
Joining_Date            0
Gender                  0
Bonus                   0
Rating                  0
Performance Category    0
dtype: int64

i)Rename the Employee_ID column to ID.

In [17]:
df.rename(columns={"Employee_ID": "ID"}, inplace=True)
print("\nDataFrame with renamed column:")
print(df)

DataFrame with renamed column:
   Employee ID     Name Department  Age  Salary  Years_of_Experience  \
0          101    Alice         HR   29   50000                    4
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
3          104    Diana  MARKETING   28   55000                    3
4          105   Edward      SALES   38   60000                   12

  Joining_Date  Gender  Bonus  Rating Performance Category
0   2020-03-15  Female   5000     4.5                 Good
1   2017-07-19    Male   7000     4.0              Average
2   2013-06-01    Male   6000     3.8              Average
3   2021-02-10  Female   4500     4.7            Excellent
4   2010-11-25    Male   5000     3.5              Average

j) Find all employees who:<br>
i. Have more than 5 years of experience.

In [19]:
Greater_5_years=df[df["Years_of_Experience"]>5]
print("\nEmployees with more than 5 years of experience:")
print(Greater_5_years)

Employees with more than 5 years of experience:
   Employee ID     Name Department  Age  Salary  Years_of_Experience  \
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
4          105   Edward      SALES   38   60000                   12

  Joining_Date Gender  Bonus  Rating Performance Category
1   2017-07-19   Male   7000     4.0              Average
2   2013-06-01   Male   6000     3.8              Average
4   2010-11-25   Male   5000     3.5              Average

ii. Belong to the IT department.

In [20]:
IT_Department=df[df["Department"]=="IT"]
print("\nEmployees in IT department:")
print(IT_Department)

Employees in IT department:
   Employee ID     Name Department  Age  Salary  Years_of_Experience  \
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10

  Joining_Date Gender  Bonus  Rating Performance Category
1   2017-07-19   Male   7000     4.0              Average
2   2013-06-01   Male   6000     3.8              Average

k) Modify the dataset by adding a new column, Tax, which deducts 10% of the Salary.

In [21]:
df['Tax'] = df['Salary'] * 0.10
print("\nDataFrame with Tax column:")
print(df)

DataFrame with Tax column:
   Employee ID     Name Department  Age  Salary  Years_of_Experience  \
0          101    Alice         HR   29   50000                    4
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
3          104    Diana  MARKETING   28   55000                    3
4          105   Edward      SALES   38   60000                   12

  Joining_Date  Gender  Bonus  Rating Performance Category     Tax
0   2020-03-15  Female   5000     4.5                 Good  5000.0
1   2017-07-19    Male   7000     4.0              Average  7000.0
2   2013-06-01    Male   6000     3.8              Average  6500.0
3   2021-02-10  Female   4500     4.7            Excellent  5500.0
4   2010-11-25    Male   5000     3.5              Average  6000.0

l) Save the modified DataFrame (with added columns) to a new CSV file.

In [22]:
df.to_csv("modified_employees.csv", index=False)
print("\nModified DataFrame saved to 'modified_employees.csv'.")

Modified DataFrame saved to 'modified_employees.csv'.